{
  "journalEntries": [
    {
      "date": "7/1/19",
      "concepts": "Downloads and Intros",
      "entry": "Downloaded pertinent programs to our computers. Listened to orientation presentation",
      "mood": "Happy"
    },
    {
      "date": "7/15/19",
      "concepts": "Javascript Functions and Debugging",
      "entry": "Went through functions chapter (Book 2 Chapter 4). Went over Chapter 5 briefly in class. Started working on exercises from Chapter 6",
      "mood": "Fine"
    },
    {
      "date": "7/16/19",
      "concepts": "Javascript Functions",
      "entry": "Worked on supplementary content \"Practice Logic, Conditions, and Iterating Collections\" and completed exercises on repl.it. Completed lightning exercise \"js-functions\".",
      "mood": "Happy"
    },
    {
      "date": "7/17/19",
      "concepts": "Javascript Functions, Objects, DOM Manipulation",
      "entry": "Continued working on exercises on objects from Chapter 6. Started on Chapter 7 \"Building DOM Components\" and started work on exercises in that chapter. Completed exercises and challenges down to \"Challenge: Composition of Smaller Components\"",
      "mood": "Happy"
    },
    {
      "date": "7/18/19",
      "concepts": "Buidling DOM Components in Javascript",
      "entry": "Completed lightning exercise on factory functions. Changed exercise on the political candidate from Chapter 6 so that the functions to change the object's state are methods within the object. Updated student components exercise so that generic element generator function works with for-of loop. Styled daily journal. Learned about DOM fragments. Started learning about APIs and json.",
      "mood": "Happy"
    },
    {
      "date": "7/19/19",
      "concepts": "Intro to APIs and Fetch",
      "entry": "Went over how to manipulate APIs again using Postman. Learned about 'fetch' and '.then'. Completed exercises on fetching info from local API and open source API and inserting html representation into the DOM. Book 2 Chapter 10.",
      "mood": "Fine"
    }
  ]
}